app/views/sellers/show.html.erb

SELECT  "sellers".* FROM "sellers" WHERE "sellers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
            <%if sale.seller_id == session[:seller_id] %>
            <td><%= Seller.find(sale.seller_id).email%></td>
            <td><%= Product.find(sale.product_id).name  %></td>

SELECT  "buyers".* FROM "buyers" WHERE "buyers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
              <% if sale.buyer_id? %>
              <%= Buyer.find(sale.buyer_id).email %>

SELECT  "sellers".* FROM "sellers" WHERE "sellers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
              <%if sale.seller_id == session[:seller_id] && sale.buyer_id == nil %>
              <td><%= Seller.find(sale.seller_id).email%></td>
              <td><%= Product.find(sale.product_id).name  %></td>