app/controllers/application_controller.rb

  def current_buyer
    @current_buyer ||= Buyer.find(session[:buyer_id]) if session[:buyer_id]
---
SELECT  "buyers".* FROM "buyers" WHERE "buyers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def current_seller
    @current_seller ||= Seller.find(session[:seller_id]) if session[:seller_id]
---
SELECT  "sellers".* FROM "sellers" WHERE "sellers"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def current_admin
    @current_admin ||=Admin.find(session[:admin_id]) if session[:admin_id]
---
SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]