app/controllers/buyers_controller.rb

 def require_same_user
   if buyer_logged_in?
   @curuser = Buyer.find(session[:buyer_id])
---
SELECT  "buyers".* FROM "buyers" WHERE "buyers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def index
    @buyers = Buyer.all
---
SELECT "buyers".* FROM "buyers"

  def show
    @sale = Sale.all
---
SELECT "sales".* FROM "sales"

  def create
    @buyer = Buyer.new(buyer_params)

    respond_to do |format|
      if @buyer.save
---
INSERT INTO "buyers" ("first_name", "last_name", "email", "birthday", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if buyer_logged_in?
        if @buyer.update(buyer_params)
          format.html { redirect_to @buyer, notice: 'Buyer was successfully updated.' }
          format.json { render :show, status: :ok, location: @buyer }
        else
          format.html { render :edit }
          format.json { render json: @buyer.errors, status: :unprocessable_entity }
        end
      elsif admin_logged_in?
        if @buyer.update(buyer_params)
---
UPDATE "buyers" SET "password_digest" = ?, "updated_at" = ? WHERE "buyers"."id" = ?  [["password_digest", "$2a$10$tjLyqM4OvM0o91T5lOy6j.6jU2F6hQG8L7Vb2Xp.KDn..n99oL/uC"], ["updated_at", "2018-12-17 17:48:05.563602"], ["id", 3]]
UPDATE "buyers" SET "password_digest" = ?, "updated_at" = ? WHERE "buyers"."id" = ?  [["password_digest", "$2a$10$dhnrk3sd9sBozZjqIWG3Pet.RRQhdbUTXbcMBy5h.3QacUvvkTEZK"], ["updated_at", "2018-12-17 17:49:14.085945"], ["id", 3]]

  def destroy
    @buyer.destroy
---
DELETE FROM "buyers" WHERE "buyers"."id" = ?  [["id", 9]]

    def set_buyer
      @buyer = Buyer.find(params[:id])
---
SELECT  "buyers".* FROM "buyers" WHERE "buyers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]