app/controllers/page_controller.rb

SELECT "sales".* FROM "sales"
---
  def index
    @sale = Sale.all