app/controllers/products_controller.rb

SELECT  "sellers".* FROM "sellers" WHERE "sellers"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def require_same_user
    if seller_logged_in?
    @curuser = Seller.find(session[:seller_id])
      if @curuser != Seller.find(params[:id]) && !admin_logged_in?

INSERT INTO "products" ("name", "description", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Fred Perry"], ["description", "Laurel!"], ["category_id", 2], ["created_at", "2018-12-16 14:45:57.145036"], ["updated_at", "2018-12-16 14:45:57.145036"]]
INSERT INTO "products" ("name", "description", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Lacoste"], ["description", "polo"], ["category_id", 2], ["created_at", "2018-12-17 17:11:33.408473"], ["updated_at", "2018-12-17 17:11:33.408473"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if seller_logged_in?
        if @product.save
          format.html { redirect_to seller_path(session[:seller_id]), notice: 'Product was successfully created.' }
          format.json { render :show, status: :created, location: @product }
        else
          format.html { render :new }
          format.json { render json: @product.errors, status: :unprocessable_entity }
        end
      elsif admin_logged_in?
        if @product.save