app/controllers/sales_controller.rb

SELECT  "sellers".* FROM "sellers" WHERE "sellers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "sales".* FROM "sales" WHERE "sales"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "sellers".* FROM "sellers" WHERE "sellers"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def require_same_user
    if seller_logged_in?
    @curuser = Seller.find(session[:seller_id])
      if @curuser != Seller.find(Sale.find(params[:id]).seller_id) && !admin_logged_in?

INSERT INTO "sales" ("seller_id", "product_id", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["seller_id", 1], ["product_id", 1], ["price", 89.0], ["created_at", "2018-12-17 13:29:25.065705"], ["updated_at", "2018-12-17 13:29:25.065705"]]
---
  def create
    @sale = Sale.new(sale_params)
    @sale.seller_id = session[:seller_id]

    respond_to do |format|
      if @sale.save

UPDATE "sales" SET "buyer_id" = ?, "updated_at" = ? WHERE "sales"."id" = ?  [["buyer_id", 11], ["updated_at", "2018-12-17 17:57:20.117299"], ["id", 5]]
---
  def update
    #if seller nakalogin
    respond_to do |format|
      if @sale.update(sale_params)

SELECT  "sales".* FROM "sales" WHERE "sales"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def set_sale
      @sale = Sale.find(params[:id])