app/controllers/sellers_controller.rb

SELECT  "sellers".* FROM "sellers" WHERE "sellers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def require_same_user
    if seller_logged_in?
    @curuser = Seller.find(session[:seller_id])
      if @curuser != Seller.find(params[:id]) && !admin_logged_in?

SELECT "sellers".* FROM "sellers"
---
  def index
    @sellers = Seller.all

SELECT "sales".* FROM "sales"
---
  def show
    @sale = Sale.all

INSERT INTO "sellers" ("first_name", "last_name", "email", "birthday", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @seller = Seller.new(seller_params)

    respond_to do |format|
      if @seller.save

UPDATE "sellers" SET "password_digest" = ?, "updated_at" = ? WHERE "sellers"."id" = ?  [["password_digest", "$2a$10$/Hn04VPsmRzT8M1rfKQeDOBTwjUOp1hKbVorRJUIASZKueiyqAbq6"], ["updated_at", "2018-12-16 09:37:30.124067"], ["id", 2]]
---
  def update
    respond_to do |format|
      if seller_logged_in?
        if @seller.update(seller_params)

DELETE FROM "sellers" WHERE "sellers"."id" = ?  [["id", 4]]
---
  def destroy
    @seller.destroy

SELECT  "sellers".* FROM "sellers" WHERE "sellers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_seller
      @seller = Seller.find(params[:id])