app/controllers/session_controller.rb

SELECT  "buyers".* FROM "buyers" WHERE "buyers"."email" = ? LIMIT ?  [["email", "admin@admin.com"], ["LIMIT", 1]]
SELECT  "sellers".* FROM "sellers" WHERE "sellers"."email" = ? LIMIT ?  [["email", "admin@admin.com"], ["LIMIT", 1]]
SELECT  "admins".* FROM "admins" WHERE "admins"."email" = ? LIMIT ?  [["email", "admin@admin.com"], ["LIMIT", 1]]
---
  def create
    user = Buyer.find_by(email: params[:session][:email])
    if user != nil
      if user.authenticate(params[:session][:password])
        session[:buyer_id] = user.id
        redirect_to buyer_path(user.id)
      else
        flash.now[:danger] = "wrong password"
        render 'new'
      end
    end
    user = Seller.find_by(email: params[:session][:email])
    if user != nil
      if user && user.authenticate(params[:session][:password])
        session[:seller_id] = user.id
        redirect_to seller_path(user.id)
      else
        flash.now[:danger] = "wrong password"
        render 'new'
      end
    end
    user = Admin.find_by(email: params[:session][:email])