app/views/products/_form.html.erb

  <%= form.label :category_id %>
  <%= form.select(:category_id, Category.all.pluck(:name, :id))%>
---
SELECT "categories"."name", "categories"."id" FROM "categories"