app/views/sales/_form.html.erb

SELECT "sellers"."email", "sellers"."id" FROM "sellers"
---
  <%= form.label :seller_id %>
  <%= form.select(:seller_id, Seller.all.pluck(:email, :id))%>

SELECT "products"."name", "products"."id" FROM "products"
---
  <%= form.label :product_id %>
  <%= form.select(:product_id, Product.all.pluck(:name, :id))%>