app/views/sales/edit.html.erb

SELECT  "sellers".* FROM "sellers" WHERE "sellers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
<h1>Editing Sale of <%=Seller.find(@sale.seller_id).email%></h1>