app/views/sales/new.html.erb

<h1>New Sale for <i><%= Seller.find(session[:seller_id]).email %></i></h1>
---
SELECT  "sellers".* FROM "sellers" WHERE "sellers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]