app/views/sales/show.html.erb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <%if buyer_logged_in?%>
  <h1>Nice! You just bought a <%=Product.find(@sale.product_id).name%></h1>